/*
 Navicat Premium Data Transfer

 Source Server         : dean-ubuntu-mysql-waiwang
 Source Server Type    : MySQL
 Source Server Version : 50734
 Source Host           : dean0731.cn:1521
 Source Schema         : zzumap

 Target Server Type    : MySQL
 Target Server Version : 50734
 File Encoding         : 65001

 Date: 18/05/2021 16:52:07
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for building
-- ----------------------------
DROP TABLE IF EXISTS `building`;
CREATE TABLE `building`  (
  `bid` bigint(20) NOT NULL COMMENT 'ID主键',
  `name` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '建筑物名称',
  `child_name` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '建筑物有多栋楼',
  `belong` varchar(10) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '所属校区',
  `height` double NULL DEFAULT NULL COMMENT '建筑物高度',
  `gid` varchar(5) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '应该是建筑物组的标识',
  `type` varchar(5) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '暂时未知',
  `tag` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '标签',
  `tel` varchar(11) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '联系方式',
  `address` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '建筑物全局地址',
  `introduction` text CHARACTER SET utf8 COLLATE utf8_general_ci NULL COMMENT '描述信息',
  `create_time` datetime(0) NULL DEFAULT CURRENT_TIMESTAMP(0) COMMENT '记录创建时间',
  `update_time` datetime(0) NULL DEFAULT CURRENT_TIMESTAMP(0) ON UPDATE CURRENT_TIMESTAMP(0) COMMENT '记录修改时间',
  PRIMARY KEY (`bid`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of building
-- ----------------------------
INSERT INTO `building` VALUES (1394239021877559296, '东区招待所', '东区招待所_1_2', '东校区', 2.37, 'g349', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:01', '2021-05-17 18:31:01');
INSERT INTO `building` VALUES (1394239021877559297, '东区招待所', '东区招待所_1_1', '东校区', 23.24, 'g349', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:01', '2021-05-17 18:31:01');
INSERT INTO `building` VALUES (1394239021877559298, '东区行政楼', '东区行政楼_2_1', '东校区', 4.15, 'a27', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:01', '2021-05-17 18:31:01');
INSERT INTO `building` VALUES (1394239021877559299, '东区行政楼', '东区行政楼_1_1', '东校区', 25.72, 'a27', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:01', '2021-05-17 18:31:01');
INSERT INTO `building` VALUES (1394239021877559300, '东区行政楼', '东区行政楼_3_1', '东校区', 3.25, 'a27', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:01', '2021-05-17 18:31:01');
INSERT INTO `building` VALUES (1394239021877559301, '东校区北实验楼', '东校区北实验楼', '东校区', 17.44, 'a29', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:01', '2021-05-17 18:31:01');
INSERT INTO `building` VALUES (1394239021877559302, '东校区浴池', '东校区浴池_1_1', '东校区', 13.07, 'a153', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:01', '2021-05-17 18:31:01');
INSERT INTO `building` VALUES (1394239021877559303, '东校区浴池', '东校区浴池_1_2', '东校区', 4.79, 'a153', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:01', '2021-05-17 18:31:01');
INSERT INTO `building` VALUES (1394239021877559304, '东校区综合楼', '东校区综合楼_1_1', '东校区', 21.55, 'a30', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:01', '2021-05-17 18:31:01');
INSERT INTO `building` VALUES (1394239021877559305, '东校区综合楼', '东校区综合楼_1_3', '东校区', 3.33, 'a30', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559306, '东校区综合楼', '东校区综合楼_1_2', '东校区', 3.72, 'a30', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559307, '东校区综合楼', '东校区综合楼_2_1', '东校区', 4.84, 'a30', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559308, '东校区综合楼', '东校区综合楼_1_4', '东校区', 2.86, 'a30', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559309, '东校区西大门', '东校区西大门_2_1', '东校区', 4.88, 'a156', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559310, '东校区西大门', '东校区西大门_1_1', '东校区', 4.18, 'a156', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559311, '中原路31-34号楼门面房', '中原路31-34号楼门面房_3', '东校区', 16.1, 'a407', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559312, '中原路31-34号楼门面房', '中原路31-34号楼门面房_1', '东校区', 1, 'a154', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559313, '中原路31-34号楼门面房', '中原路31-34号楼门面房_4', '东校区', 16.1, 'a408', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559314, '中原路31-34号楼门面房', '中原路31-34号楼门面房_2', '东校区', 19.04, 'a406', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559315, '人体科学馆', '人体科学馆_1_2', '东校区', 5.29, 'a373', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559316, '人体科学馆', '人体科学馆_1_1', '东校区', 14.43, 'a373', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559317, '体育教研室', '体育教研室', '东校区', 10.54, 'a26', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559318, '供暖中心', '供暖中心', '南校区', 6.27, 'a403', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559319, '保卫处(总机楼)', '保卫处(总机楼)_1_2', '南校区', 2.61, 'a179', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559320, '保卫处(总机楼)', '保卫处(总机楼)_1_1', '南校区', 15.03, 'a179', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559321, '公共卫生学院楼', '公共卫生学院楼_1_1', '东校区', 18.5, 'a22', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559322, '公共卫生学院楼', '公共卫生学院楼_1_2', '东校区', 3.07, 'a22', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559323, '公共卫生学院楼', '公共卫生学院楼_1_3', '东校区', 3.96, 'a22', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559324, '公共卫生学院楼', '公共卫生学院楼_1_4', '东校区', 3.2, 'a22', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559325, '公共卫生学院楼', '公共卫生学院楼_2_2', '东校区', 3.2, 'a22', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559326, '公共卫生学院楼', '公共卫生学院楼_2_1', '东校区', 18.5, 'a22', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559327, '出版社北楼', '出版社北楼', '东校区', 11.08, 'a148', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559328, '出版社南楼', '出版社南楼_1_1', '东校区', 12.12, 'g22', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559329, '化工学院化工原理实验楼', '化工学院化工原理实验楼', '北校区', 7.26, 'a15', '2', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559330, '化工学院生化中心', '化工学院生化中心', '北校区', 7.75, 'c14', '2', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559331, '北区产业楼', '北区产业楼_2_1', '北校区', 14.95, 'a1', '2', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559332, '北区产业楼', '北区产业楼_1_1', '北校区', 79.61, 'a1', '2', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559333, '北区产业楼', '北区产业楼_1_2', '北校区', 7.86, 'a1', '2', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559334, '北大门', '北大门_1_1', '南校区', 9.81, 'a161', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559335, '北大门', '北大门_2_1', '南校区', 7.34, 'a161', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559336, '北大门', '北大门_3_1', '南校区', 3.67, 'a161', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559337, '北实验室楼', '北实验室楼_1_1', '北校区', 12.12, 'a142', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559338, '北实验室楼', '北实验室楼_2_1', '北校区', 9.77, 'a142', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559339, '北松园锅炉房', '北松园锅炉房_1_1', '新校区', 4.41, 'a199', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559340, '北松园锅炉房', '北松园锅炉房_2_1', '新校区', 7.96, 'a199', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559341, '北松园锅炉房', '北松园锅炉房_3_1', '新校区', 3.53, 'a199', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559342, '北校区办公楼', '北校区办公楼_1_2', '北校区', 2.87, 'a6', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559343, '北校区办公楼', '北校区办公楼_1_1', '北校区', 14.93, 'a6', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559344, '北校区化工楼', '北校区化工楼_3_1', '北校区', 13.31, 'a12', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559345, '北校区化工楼', '北校区化工楼_2_1', '北校区', 16.54, 'a12', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559346, '北校区化工楼', '北校区化工楼_1_1', '北校区', 13.31, 'a12', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559347, '北校区实验楼', '北校区实验楼_2_1', '北校区', 20.13, 'a18', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559348, '北校区实验楼', '北校区实验楼_1_2', '北校区', 3.58, 'a18', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559349, '北校区实验楼', '北校区实验楼_1_1', '北校区', 24.78, 'a18', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559350, '北校区小礼堂', '北校区小礼堂_1_1', '北校区', 6.92, 'a140', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559351, '北校区小礼堂', '北校区小礼堂_1_2', '北校区', 2.68, 'a140', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559352, '北校区新教学楼', '北校区新教学楼_2_1', '北校区', 18.84, 'a10', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559353, '北校区新教学楼', '北校区新教学楼_1_2', '北校区', 3.85, 'a10', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559354, '北校区新教学楼', '北校区新教学楼_1_3', '北校区', 4.43, 'a10', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559355, '北校区新教学楼', '北校区新教学楼_1_1', '北校区', 23.87, 'a10', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559356, '北校区机械工程学院', '北校区机械工程学院_1_1', '北校区', 12.01, 'a141', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021877559357, '北校区机械工程学院', '北校区机械工程学院_2_1', '北校区', 9.52, 'a141', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753600, '北校区管理楼', '北校区管理楼', '北校区', 10.7, 'a7', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753601, '北校区综合楼', '北校区综合楼_1_1', '北校区', 22.34, 'b357', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753602, '北校区综合楼', '北校区综合楼_1_4', '北校区', 3.5, 'b357', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753603, '北校区综合楼', '北校区综合楼_1_3', '北校区', 3.02, 'b357', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753604, '北校区综合楼', '北校区综合楼_1_2', '北校区', 3.02, 'b357', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753605, '北校区门卫值班室', '北校区门卫值班室', '北校区', 3.56, 'a133', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753606, '北门产业处（自来水联建）', '北门产业处（自来水联建）', '南校区', 28, 'a164', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753607, '医科园公共卫生学院办公楼', '医科园公共卫生学院办公楼_1_1', '新校区', 8.99, 'g64', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753608, '医科园公共卫生学院教学楼', '医科园公共卫生学院教学楼_1_2', '新校区', 2.32, 'a64', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753609, '医科园公共卫生学院教学楼', '医科园公共卫生学院教学楼_1_1', '新校区', 8.99, 'a64', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753610, '医科园基础医学院A1楼', '医科园基础医学院A1楼_1_1', '新校区', 31.72, 'c61', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753611, '医科园基础医学院A1楼', '医科园基础医学院A1楼_2_1', '新校区', 37.92, 'c61', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753612, '医科园基础医学院A2楼', '医科园基础医学院A2楼_1_1', '新校区', 32.74, 'g61', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753613, '医科园基础医学院B楼', '医科园基础医学院B楼', '新校区', 21.73, 'a60', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753614, '医科园基础医学院C楼', '医科园基础医学院C楼_1_1', '新校区', 12.72, 'a59', '2', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753615, '医科园基础医学院D楼(办公楼)', '医科园基础医学院D楼(办公楼)_1_1', '新校区', 8.5, 'a61', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753616, '南校区东门', '南校区东门_2_1', '南校区', 4.15, 'a400', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753617, '南校区东门', '南校区东门_1_1', '南校区', 3.97, 'a400', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753618, '南校区办公楼', '南校区办公楼_2_1', '南校区', 12.75, 'b53', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753619, '南校区办公楼', '南校区办公楼_1_1', '南校区', 17.03, 'b53', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753620, '南校区办公楼', '南校区办公楼_3_1', '南校区', 12.75, 'b53', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753621, '南校区办公楼', '南校区办公楼_4_1', '南校区', 8.5, 'b53', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753622, '南校区塑料实验室', '南校区塑料实验室', '南校区', 4.07, 'a42', '2', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753623, '南校区学习堂', '南校区学习堂_5_1', '南校区', 4.72, 'a185', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753624, '南校区学习堂', '南校区学习堂_4_1', '南校区', 9.7, 'a185', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753625, '南校区学习堂', '南校区学习堂_3_1', '南校区', 7.18, 'a185', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753626, '南校区学习堂', '南校区学习堂_2_1', '南校区', 3.69, 'a185', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753627, '南校区学习堂', '南校区学习堂_1_1', '南校区', 16.36, 'a185', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753628, '南校区小礼堂', '南校区小礼堂', '南校区', 5.02, 'a177', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753629, '南校区教学11号楼', '南校区教学11号楼_2_3', '南校区', 2.42, 'a38', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753630, '南校区教学11号楼', '南校区教学11号楼_1_2', '南校区', 2.19, 'a38', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753631, '南校区教学11号楼', '南校区教学11号楼_1_3', '南校区', 2.13, 'a38', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753632, '南校区教学11号楼', '南校区教学11号楼_2_1', '南校区', 12.24, 'a38', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753633, '南校区教学11号楼', '南校区教学11号楼_3_3', '南校区', 2.41, 'a38', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753634, '南校区教学11号楼', '南校区教学11号楼_3_1', '南校区', 16.07, 'a38', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753635, '南校区教学11号楼', '南校区教学11号楼_1_1', '南校区', 12.24, 'a38', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753636, '南校区教学11号楼', '南校区教学11号楼_3_2', '南校区', 2.41, 'a38', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753637, '南校区教学11号楼', '南校区教学11号楼_2_2', '南校区', 2.35, 'a38', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753638, '南校区教学12号楼', '南校区教学12号楼_3_1', '南校区', 26.54, 'a47', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753639, '南校区教学12号楼', '南校区教学12号楼_1_1', '南校区', 21.23, 'a47', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753640, '南校区教学12号楼', '南校区教学12号楼_4_1', '南校区', 7.12, 'a47', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753641, '南校区教学12号楼', '南校区教学12号楼_2_1', '南校区', 17.86, 'a47', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753642, '南校区教学13号楼', '南校区教学13号楼_1_2', '南校区', 3.75, 'a52', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753643, '南校区教学13号楼', '南校区教学13号楼_1_1', '南校区', 12.95, 'a52', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753644, '南校区教学14号楼', '南校区教学14号楼', '南校区', 24, 'a32', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753645, '南校区教学15号楼', '南校区教学15号楼', '南校区', 28, 'a35', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753646, '南校区教学16号楼', '南校区教学16号楼', '南校区', 12, 'a36', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753647, '南校区教学17号楼', '南校区教学17号楼', '南校区', 28, 'a34', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753648, '南校区教学18号楼', '南校区教学18号楼_1_1', '南校区', 36.54, 'a54', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753649, '南校区教学18号楼', '南校区教学18号楼_1_4', '南校区', 9.54, 'a54', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753650, '南校区教学18号楼', '南校区教学18号楼_1_3', '南校区', 4.61, 'a54', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753651, '南校区教学18号楼', '南校区教学18号楼_1_2', '南校区', 4.61, 'a54', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753652, '南校区教学19号楼', '南校区教学19号楼_1_1', '南校区', 20.53, 'a57', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753653, '南校区教学19号楼', '南校区教学19号楼_2_1', '南校区', 12.43, 'a57', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753654, '南校区教学19号楼', '南校区教学19号楼_3_1', '南校区', 8.48, 'a57', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753655, '南校区教学19号楼', '南校区教学19号楼_4_1', '南校区', 8.48, 'a57', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753656, '南校区教学20号楼', '南校区教学20号楼_2_1', '南校区', 20.52, 'a50', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753657, '南校区教学20号楼', '南校区教学20号楼_3_1', '南校区', 23.52, 'a50', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753658, '南校区教学20号楼', '南校区教学20号楼_1_1', '南校区', 20.52, 'a50', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753659, '南校区教学21号楼（机械工程学院）', '南校区教学21号楼(机械工程学院)_1_1', '南校区', 26.84, 'a51', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753660, '南校区教学21号楼（机械工程学院）', '南校区教学21号楼(机械工程学院)_2_1', '南校区', 8.24, 'a51', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753661, '南校区教学22号楼', '南校区教学22号楼_3_1', '南校区', 4.36, 'a37', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753662, '南校区教学22号楼', '南校区教学22号楼_4_1', '南校区', 4.36, 'a37', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753663, '南校区教学22号楼', '南校区教学22号楼_5_1', '南校区', 26.23, 'a37', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753664, '南校区教学22号楼', '南校区教学22号楼_6_1', '南校区', 26.23, 'a37', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753665, '南校区教学22号楼', '南校区教学22号楼_2_1', '南校区', 4.36, 'a37', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753666, '南校区教学22号楼', '南校区教学22号楼_1_1', '南校区', 22.69, 'a37', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753667, '南校区教学23号楼（物理科研楼）', '南校区教学23号楼（物理科研楼）_2_1', '南校区', 19.38, 'a49', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753668, '南校区教学23号楼（物理科研楼）', '南校区教学23号楼（物理科研楼）_1_1', '南校区', 23.4, 'a49', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753669, '南校区教学23号楼（物理科研楼）', '南校区教学23号楼（物理科研楼）_1_2', '南校区', 3.6, 'a49', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753670, '南校区教学23号楼（物理科研楼）', '南校区教学23号楼（物理科研楼）_3_1', '南校区', 4.18, 'a49', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753671, '南校区教学2号楼', '南校区教学2号楼', '南校区', 12.15, 'a56', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753672, '南校区教学3号楼', '南校区教学3号楼', '南校区', 12.15, 'a44', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753673, '南校区教学4号楼', '南校区教学4号楼', '南校区', 15.66, 'a41', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753674, '南校区教学5号楼', '南校区教学5号楼', '南校区', 12.15, 'a46', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753675, '南校区教学6号楼', '南校区教学6号楼', '南校区', 12.15, 'a45', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753676, '南校区教学8号楼(老化学楼)', '南校区教学8号楼(老化学楼)', '南校区', 12.15, 'a40', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753677, '南校区教学9号楼', '南校区教学9号楼', '南校区', 12.85, 'a39', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753678, '南校区电工房1', '南校区电工房1_2_1', '南校区', 7.69, 'a171', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753679, '南校区电工房1', '南校区电工房1_1_1', '南校区', 5.81, 'a171', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753680, '南校区电工房1', '南校区电工房1_3_1', '南校区', 3.46, 'a171', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753681, '南校区电工房1', '南校区电工房1_1_2', '南校区', 1.34, 'a171', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753682, '南校区电工房1', '南校区电工房1_4_1', '南校区', 3.67, 'a171', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753683, '南校区电工房2', '南校区电工房2', '南校区', 3.67, 'a402', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753684, '南校区电工房3', '南校区电工房3', '南校区', 8.09, 'a173', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753685, '南校区老图书馆', '南校区办公楼_5_2', '南校区', 2.26, 'a53', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753686, '南校区老图书馆', '南校区办公楼_5_1', '南校区', 16.59, 'a53', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753687, '南校区花房', '南校区花房_2_1', '南校区', 2.93, 'a172', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753688, '南校区花房', '南校区花房_1_1', '南校区', 8.3, 'a172', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753689, '南校区逸夫楼', '南校区逸夫楼', '南校区', 17.52, 'a33', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753690, '南校区锅炉房', '南校区锅炉房_3_1', '南校区', 4.88, 'a170', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753691, '南校区锅炉房', '南校区锅炉房_1_1', '南校区', 7.76, 'a170', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753692, '南校区锅炉房', '南校区锅炉房_2_1', '南校区', 4.78, 'a170', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753693, '博士后实验楼', '博士后实验楼_1_1', '东校区', 21.66, 'g5', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753694, '卫生科工人宿舍', '卫生科工人宿舍', '南校区', 9.38, 'a176', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753695, '后勤管理楼', '后勤管理楼', '北校区', 7.76, 'a143', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753696, '后勤集团中心配电所（1）', '后勤集团中心配电所（1）', '北校区', 4.65, 'a20', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753697, '后勤集团公司职工宿舍（1）', '后勤集团公司职工宿舍（1）', '北校区', 8.1, 'a123', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753698, '后勤集团带钜车间', '后勤集团带钜车间_1_1', '北校区', 8.97, 'f413', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753699, '后勤集团维修服务公司', '后勤集团维修服务公司_1_1', '南校区', 7.54, 'a178', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753700, '后勤集团维修服务公司', '后勤集团维修服务公司_2_1', '南校区', 6, 'a178', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753701, '国家橡塑模具工程研究中心', '国家橡塑模具工程研究中心_2_1', '北校区', 5.74, 'a146', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753702, '国家橡塑模具工程研究中心', '国家橡塑模具工程研究中心_1_1', '北校区', 8.1, 'a146', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753703, '国家超级计算郑州中心', '国家超级计算郑州中心_1_5', '新校区', 23.2, 's11', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753704, '国家超级计算郑州中心', '国家超级计算郑州中心_1_3', '新校区', 28, 's11', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753705, '国家超级计算郑州中心', '国家超级计算郑州中心_1_2', '新校区', 11.2, 's11', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753706, '国家超级计算郑州中心', '国家超级计算郑州中心_1_4', '新校区', 14, 's11', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753707, '国家超级计算郑州中心', '国家超级计算郑州中心_1_2', '新校区', 11.2, 's11', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753708, '国家超级计算郑州中心', '国家超级计算郑州中心_1_1', '新校区', 7.51, 's11', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753709, '国家超级计算郑州中心', '国家超级计算郑州中心_1_3', '新校区', 28, 's11', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753710, '国家超级计算郑州中心', '国家超级计算郑州中心_1_3', '新校区', 28, 's11', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753711, '国家超级计算郑州中心', '国家超级计算郑州中心_1_4', '新校区', 14, 's11', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753712, '国家超级计算郑州中心', '国家超级计算郑州中心_1_1', '新校区', 7.51, 's11', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753713, '国家超级计算郑州中心', '国家超级计算郑州中心_1_4_1', '新校区', 14, 's11', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753714, '国家超级计算郑州中心', '国家超级计算郑州中心_1_1', '新校区', 7.51, 's11', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753715, '国家超级计算郑州中心', '国家超级计算郑州中心_1_2', '新校区', 11.2, 's11', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753716, '国家超级计算郑州中心', '国家超级计算郑州中心_1_6', '新校区', 36, 's11', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753717, '国家超级计算郑州中心', '国家超级计算郑州中心_1_4_1', '新校区', 14, 's11', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753718, '国家超级计算郑州中心', '国家超级计算郑州中心_1_4', '新校区', 11.2, 's11', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753719, '土建学院结构实验室（东）', '土建学院结构实验室（东）_1_1', '北校区', 11.25, 'a2', '2', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753720, '土建学院结构实验室（西）', '土建学院结构实验室（西）_1_1', '北校区', 15.33, 'd2', '2', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753721, '土建结构研究中心', '土建结构研究中心', '北校区', 8.97, 'g413', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753722, '基础医学院', '基础医学院_2_4', '东校区', 1.78, 'a28', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753723, '基础医学院', '基础医学院_2_3', '东校区', 1.63, 'a28', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753724, '基础医学院', '基础医学院_2_1', '东校区', 14.4, 'a28', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021881753725, '基础医学院', '基础医学院_2_2', '东校区', 7.33, 'a28', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947904, '基础医学院E楼', '基础医学院E楼_2_1', '新校区', 16.52, 'a63', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947905, '基础医学院E楼', '基础医学院E楼_1_1', '新校区', 8.6, 'a63', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947906, '基础医学院F楼', '基础医学院F楼_2_1', '新校区', 16.52, 'a62', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947907, '基础医学院F楼', '基础医学院F楼_1_1', '新校区', 8.6, 'a62', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947908, '实验中心楼', '实验中心楼_1_1', '东校区', 22.18, 'g4', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947909, '实验中心楼', '实验中心楼_1_2', '东校区', 4.02, 'g4', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947910, '工科园一组团化工学院办公楼', '工科园一组团化工学院办公楼_1_1', '新校区', 14.59, 'g74', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947911, '工科园一组团化工学院教学楼', '工科园一组团化工学院教学楼_1_3', '新校区', 4.13, 'a74', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947912, '工科园一组团化工学院教学楼', '工科园一组团化工学院教学楼_1_1', '新校区', 23.48, 'a74', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947913, '工科园一组团化工学院教学楼', '工科园一组团化工学院教学楼_1_2', '新校区', 4.78, 'a74', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947914, '工科园一组团土木工程学院办公楼', '工科园一组团土木工程学院办公楼_2_1', '新校区', 12.07, 'g76', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947915, '工科园一组团土木工程学院办公楼', '工科园一组团土木工程学院办公楼_1_1', '新校区', 11.98, 'g76', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947916, '工科园一组团土木工程学院教学楼', '工科园一组团土木工程学院教学楼_1_3', '新校区', 4.12, 'a76', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947917, '工科园一组团土木工程学院教学楼', '工科园一组团土木工程学院教学楼_1_1', '新校区', 22.9, 'a76', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947918, '工科园一组团土木工程学院教学楼', '工科园一组团土木工程学院教学楼_1_4', '新校区', 4.73, 'a76', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947919, '工科园一组团土木工程学院教学楼', '工科园一组团土木工程学院教学楼_1_2', '新校区', 4.12, 'a76', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947920, '工科园一组团建筑工程学院办公楼', '工科园一组团建筑工程学院办公楼_2_1', '新校区', 17.36, 'g75', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947921, '工科园一组团建筑工程学院教学楼', '工科园一组团建筑工程学院教学楼_1_4', '新校区', 4.17, 'a75', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947922, '工科园一组团建筑工程学院教学楼', '工科园一组团建筑工程学院教学楼_1_3', '新校区', 4.17, 'a75', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947923, '工科园一组团建筑工程学院教学楼', '工科园一组团建筑工程学院教学楼_1_2', '新校区', 4.57, 'a75', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947924, '工科园一组团建筑工程学院教学楼', '工科园一组团建筑工程学院教学楼_3_1', '新校区', 4.73, 'a75', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947925, '工科园一组团建筑工程学院教学楼', '工科园一组团建筑工程学院教学楼_1_1', '新校区', 23.35, 'a75', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947926, '工科园一组团机械工程学院办公楼', '工科园一组团机械工程学院办公楼_3_1', '新校区', 15.78, 'g77', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947927, '工科园一组团机械工程学院办公楼', '工科园一组团机械工程学院办公楼_4_1', '新校区', 8.36, 'g77', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947928, '工科园一组团机械工程学院办公楼', '工科园一组团机械工程学院办公楼_1_1', '新校区', 21.09, 'g77', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947929, '工科园一组团机械工程学院办公楼', '工科园一组团机械工程学院办公楼_1_2', '新校区', 4.23, 'g77', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947930, '工科园一组团机械工程学院教学楼', '工科园一组团机械工程学院教学楼_1_3', '新校区', 4.25, 'a77', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947931, '工科园一组团机械工程学院教学楼', '工科园一组团机械工程学院教学楼_1_4', '新校区', 4.9, 'a77', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947932, '工科园一组团机械工程学院教学楼', '工科园一组团机械工程学院教学楼_1_1', '新校区', 23.3, 'a77', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947933, '工科园一组团机械工程学院教学楼', '工科园一组团机械工程学院教学楼_1_2', '新校区', 4.25, 'a77', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947934, '工科园三组团（1）号楼', '工科园三组团（1）号楼_1_2', '新校区', 4.22, 'a72', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947935, '工科园三组团（1）号楼', '工科园三组团（1）号楼_1_1', '新校区', 23.46, 'a72', '2', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947936, '工科园三组团（2）号楼', '工科园三组团（2）号楼_1_1', '新校区', 15.88, 'a73', '2', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947937, '工科园三组团（2）号楼', '工科园三组团（2）号楼_1_2', '新校区', 4.26, 'a73', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947938, '工科园三组团（3）号楼', '工科园三组团（3）号楼_1_2', '新校区', 2.73, 'a71', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947939, '工科园三组团（3）号楼', '工科园三组团（3）号楼_1_3', '新校区', 4.28, 'a71', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947940, '工科园三组团（3）号楼', '工科园三组团（3）号楼_1_1', '新校区', 23.62, 'a71', '2', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947941, '工科园三组团（4）号楼', '工科园三组团（4）号楼_1_1', '新校区', 12.22, 'g72', '2', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947942, '工科园三组团（4）号楼', '工科园三组团（4）号楼_1_2', '新校区', 2.72, 'g72', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947943, '工科园中心配电站', '工科园中心配电站_1_1', '新校区', 12.22, 'a196', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947944, '工科园中心配电站', '工科园中心配电站_2_1', '新校区', 3.78, 'a196', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947945, '工科园二组团（1）号楼', '工科园二组团（1）号楼_1_1', '新校区', 19.92, 'a68', '2', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947946, '工科园二组团（1）号楼', '工科园二组团（1）号楼_1_4', '新校区', 4.01, 'a68', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947947, '工科园二组团（1）号楼', '工科园二组团（1）号楼_1_5', '新校区', 3.07, 'a68', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947948, '工科园二组团（2）号楼', '工科园二组团（2）号楼_1_1', '新校区', 19.92, 'g68', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947949, '工科园二组团（2）号楼', '工科园二组团（2）号楼_1_2', '新校区', 4.76, 'g68', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947950, '工科园二组团（3）号楼', '工科园二组团（3）号楼_1_2', '新校区', 4.76, 'g69', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947951, '工科园二组团（3）号楼', '工科园二组团（3）号楼_1_1', '新校区', 19.92, 'g69', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947952, '工科园二组团（4）号楼', '工科园二组团（4）号楼_1_2', '新校区', 4.58, 'a69', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947953, '工科园二组团（4）号楼', '工科园二组团（4）号楼_1_3', '新校区', 4.12, 'a69', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947954, '工科园二组团（4）号楼', '工科园二组团（4）号楼_1_1', '新校区', 20.58, 'a69', '2', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947955, '工科园二组团（5）号楼', '工科园二组团（5）号楼_1_1', '新校区', 19.94, 'a70', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947956, '工科园二组团（5）号楼', '工科园二组团（5）号楼_1_2', '新校区', 4.02, 'a70', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947957, '工科园二组团（5）号楼', '工科园二组团（5）号楼_2_1', '新校区', 9.01, 'a70', '2', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947958, '工科园信息平台与变电站', '工科园信息平台与变电站', '新校区', 4.33, 'a195', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947959, '工科园锅炉房', '工科园锅炉房_2_1', '新校区', 7.93, 'a203', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947960, '工科园锅炉房', '工科园锅炉房_1_1', '新校区', 5.32, 'a203', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947961, '工程力学系实验楼', '工程力学系实验楼', '新校区', 19.65, 'a81', '2', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947962, '工程技术培训中心', '工程技术培训中心', '北校区', 10.96, 'a3', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947963, '平房教室', '平房教室', '东校区', 5.02, 'a24', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947964, '应力分析研究所', '应力分析研究所', '北校区', 4, 'g1', '2', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947965, '接待服务中心', '接待服务中心_4_1', '南校区', 6.77, 'a174', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947966, '接待服务中心', '接待服务中心_3_2', '南校区', 2.52, 'a174', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947967, '接待服务中心', '接待服务中心_1_2', '南校区', 2.72, 'a174', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947968, '接待服务中心', '接待服务中心_3_1', '南校区', 12.96, 'a174', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947969, '接待服务中心', '接待服务中心_5_1', '南校区', 4.68, 'a174', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947970, '接待服务中心', '接待服务中心_2_1', '南校区', 12.96, 'a174', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947971, '接待服务中心', '接待服务中心_1_1', '南校区', 12.96, 'a174', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947972, '放射科', '放射科', '北校区', 4.54, 'a134', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947973, '文科园北高低压配与锅炉房', '文科园北高低压配与锅炉房_2_1', '新校区', 4.83, 'a398', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947974, '文科园北高低压配与锅炉房', '文科园北高低压配与锅炉房_1_1', '新校区', 3.92, 'a398', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947975, '文科园北高低压配与锅炉房', '文科园北高低压配与锅炉房_3_1', '新校区', 5.39, 'a398', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947976, '文科园商学院楼', '文科园商学院楼_1_1', '新校区', 21.68, 'a96', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947977, '文科园商学院楼', '文科园商学院楼_1_2', '新校区', 3.51, 'a96', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947978, '文科园教育学院楼', '文科园教育学院楼_3_1', '新校区', 13.68, 'a93', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947979, '文科园教育学院楼', '文科园教育学院楼_2_1', '新校区', 13.68, 'a93', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947980, '文科园教育学院楼', '文科园教育学院楼_1_1', '新校区', 21.41, 'a93', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947981, '文科园新闻、人文、历史学院楼', '文科园新闻、人文、历史学院楼_8_1', '新校区', 21.68, 'a95', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947982, '文科园新闻、人文、历史学院楼', '文科园新闻、人文、历史学院楼_1_1', '新校区', 17.2, 'a95', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947983, '文科园新闻、人文、历史学院楼', '文科园新闻、人文、历史学院楼_7_1', '新校区', 8.34, 'a95', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947984, '文科园新闻、人文、历史学院楼', '文科园新闻、人文、历史学院楼_6_1', '新校区', 8.52, 'a95', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947985, '文科园新闻、人文、历史学院楼', '文科园新闻、人文、历史学院楼_5_1', '新校区', 8.52, 'a95', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947986, '文科园新闻、人文、历史学院楼', '文科园新闻、人文、历史学院楼_4_1', '新校区', 17.48, 'a95', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947987, '文科园新闻、人文、历史学院楼', '文科园新闻、人文、历史学院楼_2_1', '新校区', 21.6, 'a95', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947988, '文科园新闻、人文、历史学院楼', '文科园新闻、人文、历史学院楼_3_1', '新校区', 9.86, 'a95', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947989, '文科园旅游、信息管理学院楼', '文科园旅游、信息管理学院楼_2_1', '新校区', 8.3, 'a91', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947990, '文科园旅游、信息管理学院楼', '文科园旅游、信息管理学院楼_1_1', '新校区', 21.87, 'a91', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947991, '文科园法学、公共管理学院楼', '文科园法学、公共管理学院楼_4_1', '新校区', 8.33, 'a92', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947992, '文科园法学、公共管理学院楼', '文科园法学、公共管理学院楼_3_1', '新校区', 17.92, 'a92', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947993, '文科园法学、公共管理学院楼', '文科园法学、公共管理学院楼_2_1', '新校区', 13.65, 'a92', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947994, '文科园法学、公共管理学院楼', '文科园法学、公共管理学院楼_1_2', '新校区', 3.31, 'a92', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947995, '文科园法学、公共管理学院楼', '文科园法学、公共管理学院楼_1_1', '新校区', 21.65, 'a92', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947996, '文科园美术学院楼', '文科园美术学院楼_3_1', '新校区', 13.52, 'a94', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947997, '文科园美术学院楼', '文科园美术学院楼_2_1', '新校区', 17.32, 'a94', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947998, '文科园美术学院楼', '文科园美术学院楼_1_1', '新校区', 18.08, 'a94', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885947999, '文科洗衣房', '文科洗衣房', '南校区', 3.67, 'a166', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948000, '新校区锅炉房', '新校区锅炉房_1_1', '新校区', 7.58, 'a192', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948001, '新校区锅炉房', '新校区锅炉房_2_1', '新校区', 4.96, 'a192', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948002, '新茶水房', '新茶水房_2_1', '北校区', 9.98, 'a135', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948003, '新茶水房', '新茶水房_1_1', '北校区', 7.31, 'a135', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948004, '材力馆', '材力馆_2_1', '北校区', 5.81, 'a17', '2', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948005, '材力馆', '材力馆_1_1', '北校区', 12.37, 'a17', '2', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948006, '材料学院实验室及扩建', '材料学院实验室及扩建_1_1', '北校区', 4.08, 'a8', '2', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948007, '材料学院实验室及扩建', '材料学院实验室及扩建_2_1', '北校区', 8.43, 'a8', '2', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948008, '材料学院焊接实验室', '材料学院焊接实验室', '北校区', 8.68, 'a5', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948009, '松园南锅炉房', '松园南锅炉房_2_1', '新校区', 5.16, 'a190', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948010, '松园南锅炉房', '松园南锅炉房_1_1', '新校区', 7.33, 'a190', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948011, '松园活动中心', '松园活动中心_1_2', '新校区', 3.55, 'a189', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948012, '松园活动中心', '松园活动中心_2_1', '新校区', 17.42, 'a189', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948013, '松园活动中心', '松园活动中心_1_1', '新校区', 14.04, 'a189', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948014, '松园浴池', '松园浴池_1_2', '新校区', 2.96, 'a187', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948015, '松园浴池', '松园浴池_1_1', '新校区', 17, 'a187', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948016, '松园（1）号连廊', '松园（1）号连廊', '新校区', 4.32, 'a188', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948017, '柳园东锅炉房', '柳园东锅炉房_1_1', '新校区', 5.24, 'p194', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948018, '柳园东锅炉房', '柳园东锅炉房_1_2', '新校区', 2.02, 'p194', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948019, '柳园变电所', '柳园变电所', '新校区', 12.01, 'a193', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948020, '柳园西锅炉房', '柳园西锅炉房_2_1', '新校区', 7.62, 'a194', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948021, '柳园西锅炉房', '柳园西锅炉房_1_1', '新校区', 5.24, 'a194', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948022, '校办总厂机械厂（01）', '校办总厂机械厂（01）_2_2', '北校区', 2, 'a147', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948023, '校办总厂机械厂（01）', '校办总厂机械厂（01）_1_1', '北校区', 8.96, 'a147', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948024, '校办总厂机械厂（01）', '校办总厂机械厂（01）_2_1', '北校区', 4.69, 'a147', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948025, '校办总厂机械厂（02）', '校办总厂机械厂（02）_2_1', '北校区', 3.91, 'a129', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948026, '校办总厂机械厂（02）', '校办总厂机械厂（02）_1_1', '北校区', 11.83, 'a129', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948027, '校办总厂电工厂', '校办总厂电工厂_1_1', '北校区', 10.96, 'g2', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948028, '校办总厂电工厂', '校办总厂电工厂_2_1', '北校区', 10.96, 'g2', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948029, '校医院放射科', '校医院放射科', '南校区', 4.71, 'a180', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948030, '核心教学区中区主楼', '核心教学区中区主楼_1_1', '新校区', 34.68, 'a99', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948031, '核心教学区中区主楼', '核心教学区中区主楼_2_1', '新校区', 18.71, 'a99', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948032, '核心教学区中区主楼', '核心教学区中区主楼_1_5', '新校区', 3.19, 'a99', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948033, '核心教学区中区主楼', '核心教学区中区主楼_1_4', '新校区', 3.19, 'a99', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948034, '核心教学区中区主楼', '核心教学区中区主楼_1_3', '新校区', 3.19, 'a99', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948035, '核心教学区中区主楼', '核心教学区中区主楼_1_2', '新校区', 3.19, 'a99', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948036, '核心教学区中区北附楼', '核心教学区中区北附楼_1_3', '新校区', 3.09, 'a98', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948037, '核心教学区中区北附楼', '核心教学区中区北附楼_2_1', '新校区', 18.76, 'a98', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948038, '核心教学区中区北附楼', '核心教学区中区北附楼_1_1', '新校区', 23.04, 'a98', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948039, '核心教学区中区北附楼', '核心教学区中区北附楼_1_2', '新校区', 3.16, 'a98', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948040, '核心教学区中区北附楼', '核心教学区中区北附楼_2_2', '新校区', 3.07, 'a98', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948041, '核心教学区中区南附楼', '核心教学区中区南附楼_2_1', '新校区', 18.74, 'a100', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948042, '核心教学区中区南附楼', '核心教学区中区南附楼_2_2', '新校区', 3.26, 'a100', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948043, '核心教学区中区南附楼', '核心教学区中区南附楼_1_3', '新校区', 3.26, 'a100', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948044, '核心教学区中区南附楼', '核心教学区中区南附楼_1_2', '新校区', 3.98, 'a100', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948045, '核心教学区中区南附楼', '核心教学区中区南附楼_1_1', '新校区', 23.29, 'a100', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948046, '核心教学区北区1号楼', '北核心教学区1号楼_1_4', '新校区', 7.33, 'a102', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948047, '核心教学区北区1号楼', '北核心教学区1号楼_1_3', '新校区', 7.33, 'a102', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948048, '核心教学区北区1号楼', '核心教学区北区1号楼_1_2', '新校区', 7.33, 'a102', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948049, '核心教学区北区1号楼', '核心教学区北区1号楼_1_1', '新校区', 23.26, 'a102', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948050, '核心教学区北区2号楼', '核心教学区北区2号楼_2_1', '新校区', 23.25, 'a103', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948051, '核心教学区北区2号楼', '核心教学区北区2号楼_1_1', '新校区', 23.25, 'a103', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948052, '核心教学区北区3号楼', '核心教学区北区3号楼_2_1', '新校区', 22.38, 'a104', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948053, '核心教学区北区3号楼', '核心教学区北区3号楼_1_1', '新校区', 22.38, 'a104', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948054, '核心教学区北区3号楼', '核心教学区北区3号楼_1_1', '新校区', 22.38, 'a104', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948055, '核心教学区北区4号楼', '核心教学区北区4号楼_1_1', '新校区', 18.75, 'a107', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948056, '核心教学区北区5号楼', '核心教学区北区5号楼_1_1', '新校区', 18.13, 'a108', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948057, '核心教学区北区6号楼', '核心教学区北区6号楼_2_1', '新校区', 25.3, 'a106', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948058, '核心教学区北区6号楼', '核心教学区北区6号楼_1_1', '新校区', 25.3, 'a106', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948059, '核心教学区南区1号楼', '南核心教学区1号楼_1_3', '新校区', 7.33, 'a112', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948060, '核心教学区南区1号楼', '南核心教学区1号楼_1_4', '新校区', 7.33, 'a112', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948061, '核心教学区南区1号楼', '南核心教学区1号楼_1_1', '新校区', 23.26, 'a112', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948062, '核心教学区南区1号楼', '南核心教学区1号楼_1_2', '新校区', 7.33, 'a112', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948063, '核心教学区南区2号楼', '核心教学区南区2号楼_1_1', '新校区', 23.31, 'a113', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948064, '核心教学区南区2号楼', '核心教学区南区2号楼_2_1', '新校区', 23.19, 'a113', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948065, '核心教学区南区3号楼', '核心教学区南区3号楼_1_1', '新校区', 21.85, 'a119', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948066, '核心教学区南区3号楼', '核心教学区南区3号楼_2_1', '新校区', 22.25, 'a119', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948067, '核心教学区南区4号楼', '核心教学区南区4号楼_1_1', '新校区', 18.77, 'g116', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948068, '核心教学区南区5号楼', '核心教学区南区5号楼_1_1', '新校区', 18.05, 'a117', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948069, '核心教学区南区6号楼', '核心教学区南区6号楼_2_1', '新校区', 9.49, 'a116', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948070, '核心教学区南区6号楼', '核心教学区南区6号楼_1_1', '新校区', 21.85, 'a116', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948071, '模具大楼', '模具大楼', '北校区', 52.3, 'a139', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948072, '模具车间（1）', '模具车间（1）', '北校区', 16.77, 'a144', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948073, '模具车间（2）', '模具车间（2）', '北校区', 8.11, 'a145', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948074, '水土楼(软件与应用科技学院)', '水土楼(软件与应用科技学院)_3_1', '北校区', 13.01, 'a11', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948075, '水土楼(软件与应用科技学院)', '水土楼(软件与应用科技学院)_1_1', '北校区', 13.01, 'a11', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948076, '水土楼(软件与应用科技学院)', '水土楼(软件与应用科技学院)_2_1', '北校区', 11.75, 'a11', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948077, '汽车库', '汽车库_2_1', '东校区', 15.42, 'a152', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948078, '汽车库', '汽车库_1_1', '东校区', 3.55, 'a152', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948079, '汽车队用房', '汽车队用房', '南校区', 4.1, 'a182', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948080, '浴池(二层以上琴房)', '浴池(二层以上琴房)_1_2', '南校区', 4.07, 'a55', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948081, '浴池(二层以上琴房)', '浴池(二层以上琴房)_1_1', '南校区', 13.2, 'a55', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948082, '浴池综合楼（洗浴中心）', '浴池综合楼（洗浴中心）_1_1', '新校区', 5.45, 'a191', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948083, '浴池综合楼（洗浴中心）', '浴池综合楼（洗浴中心）_2_1', '新校区', 8.18, 'a191', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948084, '澡堂', '澡堂', '北校区', 10.63, 'a122', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948085, '炊事员宿舍楼', '炊事员宿舍楼', '东校区', 5.94, 'a149', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948086, '热处理研究室', '热处理研究室_2_1', '北校区', 4.81, 'a372', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948087, '热处理研究室', '热处理研究室_1_1', '北校区', 8.17, 'a372', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948088, '环水复合材料实验室', '环水复合材料实验室_1_1', '北校区', 8.51, 'a4', '2', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948089, '环水复合材料实验室', '环水复合材料实验室_1_2', '北校区', 3.41, 'a4', '2', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948090, '环水学院农水馆', '环水学院农水馆_1_1', '北校区', 11.92, 'a13', '2', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948091, '环水学院农水馆', '环水学院农水馆_2_1', '北校区', 5.39, 'a13', '2', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948092, '环水学院水利馆', '环水学院水利馆', '北校区', 7.12, 'a16', '2', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948093, '现代分析与计算中心', '现代分析与计算中心_1_1', '新校区', 17.49, 'a58', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948094, '现代分析与计算中心', '现代分析与计算中心_2_1', '新校区', 10.05, 'a58', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948095, '现代分析与计算中心', '现代分析与计算中心_3_1', '新校区', 12.91, 'a58', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948096, '现代分析与计算中心', '现代分析与计算中心_1_2', '新校区', 2.7, 'a58', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948097, '现代分析与计算中心', '现代分析与计算中心_3_2', '新校区', 3.7, 'a58', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948098, '理科园共享中心', '理科园共享中心', '新校区', 15.47, 'g87', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948099, '理科园化学实验楼', '理科园化学实验楼_1_1', '新校区', 23.83, 'a80', '2', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948100, '理科园化学实验楼', '理科园化学实验楼_1_2', '新校区', 3, 'a80', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948101, '理科园化学实验楼', '理科园化学实验楼_1_3', '新校区', 3.7, 'a80', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948102, '理科园化学实验楼', '理科园化学实验楼_1_4', '新校区', 3.7, 'a80', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948103, '理科园化学工程学院实验楼', '理科园化学工程学院实验楼_1_1', '新校区', 23.97, 'a79', '2', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948104, '理科园化学工程学院实验楼', '理科园化学工程学院实验楼_1_3', '新校区', 3.11, 'a79', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948105, '理科园化学工程学院实验楼', '理科园化学工程学院实验楼_2_1', '新校区', 8.51, 'a79', '2', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948106, '理科园化学工程学院实验楼', '理科园化学工程学院实验楼_1_2', '新校区', 3.64, 'a79', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948107, '理科园化工馆办公楼', '理科园化工馆办公楼_1_1', '新校区', 22.66, 'a88', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948108, '理科园化工馆办公楼', '理科园化工馆办公楼_1_2', '新校区', 3.69, 'a88', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948109, '理科园化工馆办公楼', '理科园化工馆办公楼_1_3', '新校区', 3.14, 'a88', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948110, '理科园化工馆教学楼', '理科园化工馆教学楼_1_2', '新校区', 2.89, 'a89', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948111, '理科园化工馆教学楼', '理科园化工馆教学楼_2_2', '新校区', 3.57, 'a89', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948112, '理科园化工馆教学楼', '理科园化工馆教学楼_2_1', '新校区', 13.16, 'a89', '2', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948113, '理科园化工馆教学楼', '理科园化工馆教学楼_1_1', '新校区', 24.22, 'a89', '2', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948114, '理科园地球与环境实验楼', '理科园地球与环境实验楼_1_3', '新校区', 3.55, 'a78', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948115, '理科园地球与环境实验楼', '理科园地球与环境实验楼_1_2', '新校区', 3.69, 'a78', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948116, '理科园地球与环境实验楼', '理科园地球与环境实验楼_1_1', '新校区', 13.02, 'a78', '2', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948117, '理科园数力馆办公楼', '理科园数力馆办公楼_1_1', '新校区', 18.93, 'g86', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948118, '理科园数力馆办公楼', '理科园数力馆办公楼_1_2', '新校区', 3.43, 'g86', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948119, '理科园数力馆教学楼', '理科园数力馆教学楼_1_2', '新校区', 2.91, 'a86', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948120, '理科园数力馆教学楼', '理科园数力馆教学楼_1_1', '新校区', 23.93, 'a86', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948121, '理科园数力馆教学楼', '理科园数力馆教学楼_2_1', '新校区', 12.46, 'a86', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948122, '理科园材料学院实验楼', '理科园材料学院实验楼_1_3', '新校区', 3.62, 'a83', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948123, '理科园材料学院实验楼', '理科园材料学院实验楼_1_4', '新校区', 3.62, 'a83', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948124, '理科园材料学院实验楼', '理科园材料学院实验楼_1_2', '新校区', 2.93, 'a83', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948125, '理科园材料学院实验楼', '理科园材料学院实验楼_2_1', '新校区', 8.51, 'a83', '2', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948126, '理科园材料学院实验楼', '理科园材料学院实验楼_1_1', '新校区', 16.13, 'a83', '2', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948127, '理科园材料馆办公楼', '理科园材料馆办公楼_1_1', '新校区', 18.98, 'g101', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948128, '理科园材料馆办公楼', '理科园材料馆办公楼_1_2', '新校区', 3.36, 'g101', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948129, '理科园材料馆教学楼', '理科园材料馆教学楼_1_2', '新校区', 2.82, 'a101', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948130, '理科园材料馆教学楼', '理科园材料馆教学楼_1_1', '新校区', 24.13, 'a101', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948131, '理科园材料馆教学楼', '理科园材料馆教学楼_2_1', '新校区', 13.03, 'a101', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948132, '理科园物理工程学院实验楼', '理科园物理工程学院实验楼_2_1', '新校区', 16.37, 'a82', '2', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948133, '理科园物理工程学院实验楼', '理科园物理工程学院实验楼_1_3', '新校区', 3.54, 'a82', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948134, '理科园物理工程学院实验楼', '理科园物理工程学院实验楼_1_2', '新校区', 3.54, 'a82', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948135, '理科园物理工程学院实验楼', '理科园物理工程学院实验楼_1_4', '新校区', 2.9, 'a82', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948136, '理科园物理工程学院实验楼', '理科园物理工程学院实验楼_1_1', '新校区', 24.03, 'a82', '2', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948137, '理科园物理馆办公楼', '理科园物理馆办公楼_1_1', '新校区', 15.47, 'c87', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948138, '理科园物理馆办公楼', '理科园物理馆办公楼_1_2', '新校区', 3.52, 'c87', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948139, '理科园物理馆办公楼', '理科园物理馆办公楼_1_3', '新校区', 3.02, 'c87', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948140, '理科园物理馆教学楼', '理科园物理馆教学楼_2_1', '新校区', 13.1, 'a87', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948141, '理科园物理馆教学楼', '理科园物理馆教学楼_2_2', '新校区', 3.68, 'a87', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948142, '理科园物理馆教学楼', '理科园物理馆教学楼_1_1', '新校区', 24.1, 'a87', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948143, '理科园物理馆教学楼', '理科园物理馆教学楼_1_2', '新校区', 3.07, 'a87', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948144, '理科园环水馆办公楼', '理科园环水馆办公楼_2_1', '新校区', 18.98, 'a90', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948145, '理科园环水馆办公楼', '理科园环水馆办公楼_2_3', '新校区', 3.06, 'a90', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948146, '理科园环水馆办公楼', '理科园环水馆办公楼_2_2', '新校区', 3.43, 'a90', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948147, '理科园环水馆教学楼', '理科园环水馆教学楼_3_1', '新校区', 12.93, 'g90', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948148, '理科园环水馆教学楼', '理科园环水馆教学楼_1_1', '新校区', 23.99, 'g90', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948149, '理科园生物实验楼', '理科园生物实验楼_1_4', '新校区', 3.13, 'a84', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948150, '理科园生物实验楼', '理科园生物实验楼_1_2', '新校区', 3.21, 'a84', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948151, '理科园生物实验楼', '理科园生物实验楼_1_1', '新校区', 16.57, 'a84', '2', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948152, '理科园生物实验楼', '理科园生物实验楼_2_1', '新校区', 8.31, 'a84', '2', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948153, '理科园生物实验楼', '理科园生物实验楼_1_3', '新校区', 3.84, 'a84', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948154, '理科园生物馆', '理科园生物馆_2_1', '新校区', 13.03, 'a85', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948155, '理科园生物馆', '理科园生物馆_1_2', '新校区', 7.37, 'a85', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948156, '理科园生物馆', '理科园生物馆_1_1', '新校区', 20.27, 'a85', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948157, '理科园生物馆', '理科园生物馆_1_3', '新校区', 7.37, 'a85', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948158, '病解馆', '病解馆', '东校区', 7.05, 'a374', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948159, '第一教学楼', '第一教学楼_1_1', '东校区', 18.42, 'g217', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948160, '第三教学楼', '第三教学楼', '东校区', 22.7, 'a25', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948161, '第二教学楼', '第二教学楼', '东校区', 23.29, 'a23', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948162, '综合管理中心', '综合管理中心_2_1', '新校区', 11, 'a67', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948163, '综合管理中心', '综合管理中心_1_1', '新校区', 29.06, 'a67', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948164, '综合管理中心', '综合管理中心_2_2', '新校区', 3.41, 'a67', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948165, '综合设计研究院', '综合设计研究院_1_3', '北校区', 3.24, 'a132', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948166, '综合设计研究院', '综合设计研究院_1_2', '北校区', 1.5, 'a132', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948167, '综合设计研究院', '综合设计研究院_1_1', '北校区', 20.71, 'a132', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948168, '老干部活动中心', '老干部活动中心', '东校区', 10.3, 'a155', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948169, '职教中心', '职教中心', '南校区', 9.81, 'a168', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948170, '药品室', '药品室', '南校区', 3.69, 'a43', '1', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948171, '药学院A楼', '药学院A楼_3_1', '新校区', 8.52, 'a65', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948172, '药学院A楼', '药学院A楼_2_1', '新校区', 12.98, 'a65', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948173, '药学院A楼', '药学院A楼_1_2', '新校区', 2.55, 'a65', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948174, '药学院A楼', '药学院A楼_1_1', '新校区', 17.4, 'a65', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948175, '药学院B楼', '药学院B楼_1_2', '新校区', 2.52, 'g65', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948176, '药学院B楼', '药学院B楼_1_1', '新校区', 21.3, 'g65', '3', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948177, '菊园浴池', '菊园浴池_1_1', '新校区', 12.13, 'a198', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948178, '菊园浴池', '菊园浴池_2_1', '新校区', 3.94, 'a198', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948179, '资料室（教15楼旁）', '资料室（教15楼旁）', '南校区', 3.67, 'a157', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948180, '过程传热与节能重点实验室', '过程传热与节能重点实验室', '北校区', 7.75, 'a14', '2', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948181, '金属切削实验室', '金属切削实验室', '北校区', 6.52, 'a9', '2', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948182, '锅炉房东', '锅炉房东_1_1', '北校区', 20.15, 'a136', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948183, '锅炉房东', '锅炉房东_3_1', '北校区', 21.07, 'a136', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948184, '锅炉房东', '锅炉房东_2_1', '北校区', 13.62, 'a136', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948185, '锅炉房西', '锅炉房西', '北校区', 11.22, 'a411', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948186, '雕塑室', '雕塑室', '南校区', 3.74, 'a181', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948187, '高中部', '高中部_2_1', '北校区', 7.53, 'a126', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948188, '高中部', '高中部_1_2', '北校区', 3.6, 'a126', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948189, '高中部', '高中部_1_1', '北校区', 17.99, 'a126', '0', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');
INSERT INTO `building` VALUES (1394239021885948190, '高温材料实验室', '高温材料实验室', '南校区', 8.35, 'a48', '2', NULL, NULL, NULL, NULL, '2021-05-17 18:31:02', '2021-05-17 18:31:02');

-- ----------------------------
-- Table structure for course
-- ----------------------------
DROP TABLE IF EXISTS `course`;
CREATE TABLE `course`  (
  `cid` bigint(20) NOT NULL,
  `tid` bigint(20) NULL DEFAULT NULL,
  `rid` bigint(20) NULL DEFAULT NULL,
  `week` varchar(10) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `introduction` text CHARACTER SET utf8 COLLATE utf8_general_ci NULL,
  `create_time` datetime(0) NULL DEFAULT CURRENT_TIMESTAMP(0),
  `update_time` datetime(0) NULL DEFAULT CURRENT_TIMESTAMP(0) ON UPDATE CURRENT_TIMESTAMP(0),
  PRIMARY KEY (`cid`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Table structure for permission
-- ----------------------------
DROP TABLE IF EXISTS `permission`;
CREATE TABLE `permission`  (
  `pid` bigint(20) NOT NULL,
  `permission` text CHARACTER SET utf8 COLLATE utf8_general_ci NULL,
  `url` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `introduction` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `create_time` datetime(0) NULL DEFAULT CURRENT_TIMESTAMP(0),
  `update_time` datetime(0) NULL DEFAULT CURRENT_TIMESTAMP(0) ON UPDATE CURRENT_TIMESTAMP(0),
  PRIMARY KEY (`pid`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of permission
-- ----------------------------
INSERT INTO `permission` VALUES (1, '所有权限', '/*', '所有的方法', '2021-05-18 15:28:25', '2021-05-18 15:28:25');

-- ----------------------------
-- Table structure for role
-- ----------------------------
DROP TABLE IF EXISTS `role`;
CREATE TABLE `role`  (
  `rid` bigint(20) NOT NULL,
  `name` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `status` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `create_time` datetime(0) NULL DEFAULT CURRENT_TIMESTAMP(0),
  `update_time` datetime(0) NULL DEFAULT CURRENT_TIMESTAMP(0) ON UPDATE CURRENT_TIMESTAMP(0),
  PRIMARY KEY (`rid`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of role
-- ----------------------------
INSERT INTO `role` VALUES (1, 'admin', '超级管理员', '2021-05-18 15:25:47', '2021-05-18 15:25:47');
INSERT INTO `role` VALUES (2, 'user', '普通用户', '2021-05-18 15:26:22', '2021-05-18 15:26:22');
INSERT INTO `role` VALUES (3, 'guest', '游客', '2021-05-18 15:26:49', '2021-05-18 15:26:49');

-- ----------------------------
-- Table structure for role_permission
-- ----------------------------
DROP TABLE IF EXISTS `role_permission`;
CREATE TABLE `role_permission`  (
  `id` bigint(20) NOT NULL,
  `rid` bigint(20) NULL DEFAULT NULL,
  `pid` bigint(20) NULL DEFAULT NULL,
  `create_time` datetime(0) NULL DEFAULT CURRENT_TIMESTAMP(0),
  `update_time` datetime(0) NULL DEFAULT CURRENT_TIMESTAMP(0) ON UPDATE CURRENT_TIMESTAMP(0),
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Table structure for room
-- ----------------------------
DROP TABLE IF EXISTS `room`;
CREATE TABLE `room`  (
  `rid` bigint(20) NOT NULL,
  `room_number` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `bid` bigint(20) NULL DEFAULT NULL,
  `tag` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `introduction` text CHARACTER SET utf8 COLLATE utf8_general_ci NULL,
  `create_time` datetime(0) NULL DEFAULT CURRENT_TIMESTAMP(0),
  `update_time` datetime(0) NULL DEFAULT CURRENT_TIMESTAMP(0) ON UPDATE CURRENT_TIMESTAMP(0),
  PRIMARY KEY (`rid`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Table structure for source
-- ----------------------------
DROP TABLE IF EXISTS `source`;
CREATE TABLE `source`  (
  `sid` bigint(20) NOT NULL COMMENT 'ID主键',
  `oid` bigint(20) NULL DEFAULT NULL COMMENT '所属对象的id',
  `title` varchar(10) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '图片命名',
  `url` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '图片url',
  `take_time` datetime(0) NULL DEFAULT NULL COMMENT '照片拍摄日期',
  `tag` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '标签',
  `type` varchar(5) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '所属对象类型',
  `create_time` datetime(0) NULL DEFAULT CURRENT_TIMESTAMP(0) COMMENT '记录创建时间',
  `update_time` datetime(0) NULL DEFAULT CURRENT_TIMESTAMP(0) ON UPDATE CURRENT_TIMESTAMP(0) COMMENT '记录修改时间',
  PRIMARY KEY (`sid`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Table structure for teacher
-- ----------------------------
DROP TABLE IF EXISTS `teacher`;
CREATE TABLE `teacher`  (
  `tid` bigint(20) NOT NULL,
  `name` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `email` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `tel` varchar(11) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `introduction` text CHARACTER SET utf8 COLLATE utf8_general_ci NULL,
  `create_time` datetime(0) NULL DEFAULT CURRENT_TIMESTAMP(0),
  `update_time` datetime(0) NULL DEFAULT CURRENT_TIMESTAMP(0) ON UPDATE CURRENT_TIMESTAMP(0),
  PRIMARY KEY (`tid`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Table structure for user
-- ----------------------------
DROP TABLE IF EXISTS `user`;
CREATE TABLE `user`  (
  `uid` bigint(20) NOT NULL,
  `name` varchar(10) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `password` varchar(16) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `tel` varchar(11) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `introduction` text CHARACTER SET utf8 COLLATE utf8_general_ci NULL,
  `create_time` datetime(0) NULL DEFAULT CURRENT_TIMESTAMP(0),
  `update_time` datetime(0) NULL DEFAULT CURRENT_TIMESTAMP(0) ON UPDATE CURRENT_TIMESTAMP(0),
  PRIMARY KEY (`uid`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of user
-- ----------------------------
INSERT INTO `user` VALUES (1, 'admin', '123456', '10086', '我是管理员', '2021-05-18 15:27:15', '2021-05-18 15:27:15');
INSERT INTO `user` VALUES (2, 'guest', 'guest', '10086', '我是游客', '2021-05-18 16:37:03', '2021-05-18 16:37:03');

-- ----------------------------
-- Table structure for user_role
-- ----------------------------
DROP TABLE IF EXISTS `user_role`;
CREATE TABLE `user_role`  (
  `id` bigint(20) NOT NULL,
  `uid` bigint(20) NULL DEFAULT NULL,
  `rid` bigint(20) NULL DEFAULT NULL,
  `create_time` datetime(0) NULL DEFAULT CURRENT_TIMESTAMP(0),
  `update_time` datetime(0) NULL DEFAULT CURRENT_TIMESTAMP(0) ON UPDATE CURRENT_TIMESTAMP(0),
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of user_role
-- ----------------------------
INSERT INTO `user_role` VALUES (1, 1, 1, '2021-05-18 15:27:27', '2021-05-18 15:27:27');

SET FOREIGN_KEY_CHECKS = 1;
